import filterLocation from './filterLocation.vue'
export default {
    name: 'result-filter',
    components: {
        filterLocation
    },
    data() {
        return {
            filteredParams: {
                classification: '',
                localArea: '',
                humaneNum: ''
            },
            classification: ['代金券', '蛋糕甜点', '火锅', '自助餐', '小吃快餐', '日韩料理', '西餐', '聚餐宴请', '烧烤烤肉', '东北菜', '川湘菜', '江浙菜', '香锅烤鱼', '粤菜', '中式烧烤/烤串', '西北菜', '咖啡酒吧', '云贵菜', '东南亚菜', '海鲜', '素食', '台湾/客家菜', '创意菜', '汤/粥/炖菜', '蒙餐', '新疆菜', '其他美食', '京菜鲁菜'],
            area: [
                {
                    name: '朝阳区',
                    list: ['大望路', '双井', '北苑家园', '酒仙桥', '安贞', '管庄', '十八里店', '望京', '亮马桥', '建外大街', '朝外大街/世贸天阶', '左家庄', '亚运村', '四惠', '四惠东', '团结湖/朝阳公园', '三元桥', '太阳宫', '国贸/建外', '三里屯/工体', '对外经贸', '首都机场', '十里堡', '悠唐生活广场', '朝阳大悦城', '东坝', '石佛营', '甜水园', '八里庄', '工体', '百子湾', '传媒大学', '双桥', '北京欢乐谷', '高碑店', '北京东站', '霄云路', '蓝色港湾', '朝阳公园', '燕莎', '农业展览馆', '劲松', '潘家园', '姚家园', '十里河', '立水桥/北苑家园', '小营', '北沙滩', '大屯', '常营', '鸟巢/水立方', '世贸天阶', '草房', '首都机场生活区', '王四营', '霄云路/三元桥', '四惠交通枢纽', '西直河/亦庄', '和平里/国展中心', '孙河', '马泉营', '望京/善各庄 五方桥']
                },
                {
                    name: '海淀区',
                    list: ['双榆树', '上地', '远大路', '五棵松', '魏公村', '清河', '北下关', '中关村', '五道口', '航天桥', '苏州桥', '颐和园', '牡丹园/北太平庄', '公主坟/万寿路', '紫竹桥', '大钟寺', '知春路', '西三旗', '四季青', '香山/植物园', '北京大学', '人民大学', '万柳', '学院路', '北京西站/军博', '农业大学西区', '百望山森林公园/309医院']
                },
                {
                    name: '丰台区',
                    list: ['洋桥/木樨园', '刘家窑/宋家庄', '北大地/万丰路', '方庄/蒲黄榆', '北京西站/六里桥', '青塔', '北京南站/开阳里', '草桥/公益西桥', '看丹桥/新华街', '分钟寺/成寿寺', '夏家胡同/纪家庙', '马家堡/角门', '丽泽桥/丰管路', '大红门', '南苑/东高地', '卢沟桥', '云岗', '花乡/新发地', '世界公园']
                },
                {
                    name: '西城区',
                    list: ['后海/什刹海', '西直门/动物园', '西四', '虎坊桥', '复兴门', '德外大街', '广外大街', '右安门', '西单', '菜市口/陶然亭', '广内大街', '阜成门', '新街口', '宣武门', '牛街', '前门/大栅栏', '月坛', '地安门', '西便门', '金融街', '白纸坊', '和平门', '首都博物馆/莲花池东路', '前门/天坛', '长椿街']
                },
                {
                    name: '东城区',
                    list: ['东直门', '安定门', '和平里', '沙子口', '崇文门', '王府井/东单', '天坛', '东四', '朝阳门', '建国门/北京站', '东四十条', '广渠门', '雍和宫', '左安门', '南锣鼓巷', '北新桥/簋街', '崇文门新世界', '王府井/前门', '南锣古巷/鼓楼后海', '天安门广场']
                },
                {
                    name: '昌平区',
                    list: ['昌平镇', '回龙观', '天通苑', '南口镇', '小汤山镇', '北七家', '沙河', '十三陵水库', '蟒山国家森林公园', '居庸关长城', '小汤山', '明十三陵']
                },
                {
                    name: '石景山区',
                    list: ['苹果园', '古城/八角', '鲁谷', '模式口', '八大处']
                },
                {
                    name: '通州区',
                    list: ['梨园', '新华大街', '新华联', '武夷花园', '九棵树', '通州北苑', '果园', '八里桥', '马驹桥', '次渠', '宋庄', '土桥', '西集']
                },
                {
                    name: '大兴区',
                    list: ['亦庄', '旧宫', '黄村', '西红门', '庞各庄', '南苑机场/德茂桥']
                },
                {
                    name: '顺义区',
                    list: ['顺义城区', '石园', '后沙峪', '天竺', '南彩镇', '马坡牛栏山镇', '莲花山滑雪场', '小汤山/央美博艺艺术馆', '首都机场T3航站楼', '首都机场/机场路', '尺木无山']
                },
                {
                    name: '房山区',
                    list: ['长阳镇', '良乡', '十渡', '孤山寨', '房山城关', '阎村', '窦店', '霞云岭国家森林公园', '云居滑雪场', '仙栖洞', '东湖港', '上方山国家森林公园', '青龙湖', '河北镇', '燕山']
                },
                {
                    name: '密云区',
                    list: ['古北口', '桃源仙谷', '司马台长城', '密云水库', '古北水镇', '云蒙山', '金鼎湖滑雪场', '云佛山滑雪场', '白龙潭', '南山滑雪场', '密云县县城']
                },
                {
                    name: '怀柔区',
                    list: ['慕田峪长城', '青龙峡', '怀柔城区', '雁栖湖', '白河湾', '喇叭沟门白桦林景区', '神堂峪', '莲花池', '红螺寺', '黄花城水长城', '怀北滑雪场', '幽谷深潭', '怀柔经济开发区', '桥梓镇', '庙城', '怀柔电影旅游拍摄基地']
                },
                {
                    name: '延庆区',
                    list: ['八达岭', '龙庆峡', '延庆城区', '康庄', '柳沟', '百里画廊', '康西草原', '玉渡山风景区', '辉煌国际度假区']
                },
                {
                    name: '门头沟区',
                    list: ['门头沟城区', '龙凤山滑雪场', '爨底下村', '京西十八潭', '潭柘寺', '妙峰山', '灵山风景区']
                },
                {
                    name: '平谷区',
                    list: ['平谷城区', '金海湖', '石林峡', '天云山', '玻璃台']
                }
            ],
            filterHumaneNum: ['单人', '双人', '3-4人', '4-5人', '5-6人', '7-8人', '9-10人', '10人以上', '其他']
        }
    },
    methods: {
        // 修改分类选择
        handleChangeClassification(item) {
            this.filteredParams.classification = item || ''
            this.$emit('selectChange', Object.assign({}, this.filteredParams))
        },
        // 修改地区选择
        handleChangeSelect(item) {
            this.filteredParams.localArea = item || ''
            this.$emit('selectChange', Object.assign({}, this.filteredParams))
        },
        // 修改人数选择
        handleChangeHumaneNum(item) {
            this.filteredParams.humaneNum = item || ''
            this.$emit('selectChange', Object.assign({}, this.filteredParams))
        },
        // 清除全部
        handleClearSelect() {
            this.filteredParams.classification = this.filteredParams.localArea = this.filteredParams.humaneNum = ''
            this.$emit('selectChange', Object.assign({}, this.filteredParams))
        }
    }
}
